Documents/гф_БлокировкаРазблокировкаОтгрузок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>гф_БлокировкаРазблокировкаОтгрузок</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидБлокировки</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.гф_ВидыБлокировок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заблокирован</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исключения</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Согласовано</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействуетДо</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:DocumentRef.гф_БлокировкаРазблокировкаОтгрузок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/гф_БлокировкаРазблокировкаОтгрузок/Forms/гф_ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы 
 // #wortmann {
// // Типовой функционал для добавления команд
// Функционал для команды по открытию документов из договора
// #4.1.15
// Галфинд(Просто) Боцманова 2022/09/05 
// Параметры:
// Отказ, СтандартнаяОбработка
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если Параметры.Свойство("ДоговорКонтрагента") Тогда
		ДоговорКонтрагента = Параметры.ДоговорКонтрагента;
		УстановитьОтборПоДоговоруКонтрагентаИКонтрагенту();
	КонецЕсли;  
	
	УстановитьПараметрДинСписка();  //Добавлено  Галфинд \ Sakovich 19.09.2023
КонецПроцедуры
// } #wortmann

// #wortmann {
// // Типовой функционал для добавления команд
// #4.1.15
// Галфинд(Просто) Боцманова 2022/09/05 
// Параметры:
// Элемент
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры
// } #wortmann

#КонецОбласти

#Область ОбработчикиСобытийЭлементовСтраницыФормыОсновная 

// vvv Галфинд \ Sakovich 19.09.2023
&НаСервере
Процедура УстановитьПараметрДинСписка()
	ДатаБлокировки = ТекущаяДатаСеанса();
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
	Список,
	"ДатаБлокировки",
	ДатаБлокировки,
	Истина);
КонецПроцедуры // ^^^ Галфинд \ Sakovich 19.09.2023

// #wortmann {
// Замена запроса для динамического списка
// #4.1.15
// Галфинд(Просто) Боцманова 2022/09/05
&НаСервере
Процедура ИсторияНаСервере()
	Список.ТекстЗапроса = ПолучитьЗапросДляДинамическогоСписка();
КонецПроцедуры
// } #wortmann 

// #wortmann {
// #4.1.15
// Галфинд(Просто) Боцманова 2022/09/05 
// Параметры:
// Команда
&НаКлиенте
Процедура История(Команда)
	ИсторияНаСервере();
КонецПроцедуры
// } #wortmann

// #wortmann { 
// Замена запроса для динамического списка
// #4.1.15
// Галфинд(Просто) Боцманова 2022/09/05 
// Возвращаемое значение:
// Запрос.Текс - текст запроса
&НаСервере
Функция ПолучитьЗапросДляДинамическогоСписка()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	гф_БлокировкаРазблокировкаОтгрузок.Ссылка КАК Ссылка,
	|	гф_БлокировкаРазблокировкаОтгрузок.Номер КАК Номер,
	|	гф_БлокировкаРазблокировкаОтгрузок.Дата КАК Дата,
	|	гф_БлокировкаРазблокировкаОтгрузок.Организация КАК Организация,
	|	гф_БлокировкаРазблокировкаОтгрузок.Контрагент КАК Контрагент,
	|	гф_БлокировкаРазблокировкаОтгрузок.Партнер КАК Партнер,
	|	гф_БлокировкаРазблокировкаОтгрузок.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	гф_БлокировкаРазблокировкаОтгрузок.ВидБлокировки КАК ВидБлокировки,
	|	гф_БлокировкаРазблокировкаОтгрузок.Заблокирован КАК Заблокирован,
	|	гф_БлокировкаРазблокировкаОтгрузок.Исключения КАК Исключения,
	|	гф_БлокировкаРазблокировкаОтгрузок.Согласовано КАК Согласовано,
	|	гф_БлокировкаРазблокировкаОтгрузок.Комментарий КАК Комментарий,
	|	гф_БлокировкаРазблокировкаОтгрузок.Ответственный КАК Ответственный
	|ИЗ
	|	Документ.гф_БлокировкаРазблокировкаОтгрузок КАК гф_БлокировкаРазблокировкаОтгрузок";
	
	Возврат Запрос.Текст;  
	
КонецФункции
// } #wortmann 

// #wortmann {
// #4.1.15
// Галфинд(Просто) Боцманова 2022/09/14 
// Параметры:
// Команда
&НаСервере
Процедура ОтключитьИсториюНаСервере()
	Список.ТекстЗапроса= ВернутьТекстЗапросаВДинамическомСписке();
	УстановитьПараметрДинСписка();   //Добавлено  Галфинд \ Sakovich 19.09.2023
КонецПроцедуры
// } #wortmann

// #wortmann {
// #4.1.15
// Галфинд(Просто) Боцманова 2022/09/14 
// Параметры:
// Команда
&НаКлиенте
Процедура ОтключитьИсторию(Команда)
	ОтключитьИсториюНаСервере();
КонецПроцедуры
// } #wortmann 

// #wortmann { 
// Замена запроса для динамического списка
// #4.1.15
// Галфинд(Просто) Боцманова 2022/09/14 
// Возвращаемое значение:
// Запрос.Текс - текст запроса

&НаСервере
Функция ВернутьТекстЗапросаВДинамическомСписке() 
	Запрос = Новый Запрос;
	Запрос.Текст = 
 "ВЫБРАТЬ РАЗЛИЧНЫЕ
 |	Документгф_БлокировкаРазблокировкаОтгрузок.Ссылка КАК Ссылка,
 |	Документгф_БлокировкаРазблокировкаОтгрузок.ПометкаУдаления КАК ПометкаУдаления,
 |	Документгф_БлокировкаРазблокировкаОтгрузок.Номер КАК Номер,
 |	Документгф_БлокировкаРазблокировкаОтгрузок.Дата КАК Дата,
 |	Документгф_БлокировкаРазблокировкаОтгрузок.Проведен КАК Проведен,
 |	Документгф_БлокировкаРазблокировкаОтгрузок.Контрагент КАК Контрагент,
 |	Документгф_БлокировкаРазблокировкаОтгрузок.Партнер КАК Партнер,
 |	Документгф_БлокировкаРазблокировкаОтгрузок.Организация КАК Организация,
 |	Документгф_БлокировкаРазблокировкаОтгрузок.ДоговорКонтрагента КАК ДоговорКонтрагента,
 |	Документгф_БлокировкаРазблокировкаОтгрузок.ВидБлокировки КАК ВидБлокировки,
 |	Документгф_БлокировкаРазблокировкаОтгрузок.Заблокирован КАК Заблокирован,
 |	Документгф_БлокировкаРазблокировкаОтгрузок.Исключения КАК Исключения,
 |	Документгф_БлокировкаРазблокировкаОтгрузок.Согласовано КАК Согласовано,
 |	Документгф_БлокировкаРазблокировкаОтгрузок.Ответственный КАК Ответственный,
 |	ВЫРАЗИТЬ(Документгф_БлокировкаРазблокировкаОтгрузок.Комментарий КАК СТРОКА(1024)) КАК Комментарий,
 |	Документгф_БлокировкаРазблокировкаОтгрузок.МоментВремени КАК МоментВремени
 |ИЗ
 |	(ВЫБРАТЬ
 |		МАКСИМУМ(гф_БлокировкаРазблокировкаОтгрузок.Дата) КАК Дата,
 // ++ Галфинд_ДомнышеваКР_03_07_2023 
 // e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811ee164bf4a33788
 |		гф_БлокировкаРазблокировкаОтгрузок.Организация КАК Юо,
 |		гф_БлокировкаРазблокировкаОтгрузок.Контрагент КАК Юк,
 |		гф_БлокировкаРазблокировкаОтгрузок.ДоговорКонтрагента КАК Юдк,
 |		гф_БлокировкаРазблокировкаОтгрузок.ВидБлокировки КАК Юб
 //|		МАКСИМУМ(гф_БлокировкаРазблокировкаОтгрузок.Ссылка) КАК Юс // Галфинд_ДомнышеваКР_12_09_2023
 //|		гф_БлокировкаРазблокировкаОтгрузок.Организация КАК Организация,
 //|		гф_БлокировкаРазблокировкаОтгрузок.Контрагент КАК Контрагент,
 //|		гф_БлокировкаРазблокировкаОтгрузок.ДоговорКонтрагента КАК ДоговорКонтрагента,
 //|		гф_БлокировкаРазблокировкаОтгрузок.ВидБлокировки КАК ВидБлокировки
 // -- Галфинд_ДомнышеваКР_03_07_2023
 |	ИЗ
 |		Документ.гф_БлокировкаРазблокировкаОтгрузок КАК гф_БлокировкаРазблокировкаОтгрузок
 // vvv Галфинд \ Sakovich 19.09.2023
 |	{ГДЕ
 |		гф_БлокировкаРазблокировкаОтгрузок.Дата <= &ДатаБлокировки}
// ^^^ Галфинд \ Sakovich 19.09.2023
 |	
 |	СГРУППИРОВАТЬ ПО
 |		гф_БлокировкаРазблокировкаОтгрузок.Организация,
 |		гф_БлокировкаРазблокировкаОтгрузок.Контрагент,
 |		гф_БлокировкаРазблокировкаОтгрузок.ДоговорКонтрагента,
 |		гф_БлокировкаРазблокировкаОтгрузок.ВидБлокировки) КАК ВложенныйЗапрос
 |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.гф_БлокировкаРазблокировкаОтгрузок КАК Документгф_БлокировкаРазблокировкаОтгрузок
 // ++ Галфинд_ДомнышеваКР_03_07_2023 
 // e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811ee164bf4a33788
 //|		ПО ВложенныйЗапрос.Юс = Документгф_БлокировкаРазблокировкаОтгрузок.Ссылка"  ;   
 //|		ПО ВложенныйЗапрос.Дата = Документгф_БлокировкаРазблокировкаОтгрузок.Дата"  ;  
  // -- Галфинд_ДомнышеваКР_03_07_2023 
  // #wortmann {
  // e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811ee513931de0cec
  // Галфинд_Домнышева_12_09_2023
  |		ПО (ВложенныйЗапрос.Юо = Документгф_БлокировкаРазблокировкаОтгрузок.Организация
  |		И ВложенныйЗапрос.Юк = Документгф_БлокировкаРазблокировкаОтгрузок.Контрагент
  |		И ВложенныйЗапрос.Юдк = Документгф_БлокировкаРазблокировкаОтгрузок.ДоговорКонтрагента
  |		И ВложенныйЗапрос.Юб = Документгф_БлокировкаРазблокировкаОтгрузок.ВидБлокировки
  |		И ВложенныйЗапрос.Дата = Документгф_БлокировкаРазблокировкаОтгрузок.Дата)"  ;  
  // } #wortmann
 	Возврат Запрос.Текст;
КонецФункции
 // } #wortmann

// #wortmann {
// Отбор формы списка по договору контрагента ,для открытия из договора
// #4.1.15
// Галфинд(Просто) Боцманова 2022/09/05
&НаСервере
Процедура УстановитьОтборПоДоговоруКонтрагентаИКонтрагенту()	
	// #wortmann {
	// изменение отбора списка при открытии 
	//из договора,добавлен отбор по контрагенту,договору и не заполнену договору
	// #4.1.15
	// Галфинд(Просто) Боцманова 2022/10/08 
	ГруппаПоКонтрагенту = Список.Отбор.Элементы.Добавить(
        Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
    ГруппаПоКонтрагенту.ТипГруппы = 
        ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ; 
		
	ЭлементОтбораПоКонтрагенту = ГруппаПоКонтрагенту.Элементы.Добавить(
        Тип("ЭлементОтбораКомпоновкиДанных")); 
    ЭлементОтбораПоКонтрагенту.ЛевоеЗначение = 
        Новый ПолеКомпоновкиДанных("Партнер");
    ЭлементОтбораПоКонтрагенту.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
    ЭлементОтбораПоКонтрагенту.Использование = Истина; 
	ЭлементОтбораПоКонтрагенту.ПравоеЗначение = ДоговорКонтрагента.Партнер;	
	
	ГруппаПоДоговору = ГруппаПоКонтрагенту.Элементы.Добавить(
        Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
    ГруппаПоДоговору.ТипГруппы = 
        ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли; 
		
	ЭлементОтбораПоДоговору = ГруппаПоДоговору.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбораПоДоговору.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДоговорКонтрагента");
	ЭлементОтбораПоДоговору.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбораПоДоговору.ПравоеЗначение = ДоговорКонтрагента;		
	
	ЭлементОтбораПоДоговору1 = ГруппаПоДоговору.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбораПоДоговору1.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДоговорКонтрагента");
	ЭлементОтбораПоДоговору1.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбораПоДоговору1.ПравоеЗначение = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();

		
	// } #wortmann
	
КонецПроцедуры
// } #wortmann

#КонецОбласти

#Область ПодключаемыеКоманды 

// СтандартныеПодсистемы.ПодключаемыеКоманды

// #wortmann {
// Типовой функционал для добавления команд
// #4.1.15
// Галфинд(Просто) Боцманова 2022/09/05 
// Параметры:
// Команда
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	
	ОчиститьСообщения();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
	
КонецПроцедуры
// } #wortmann

// #wortmann {
// Типовой функционал для добавления команд
// #4.1.15
// Галфинд(Просто) Боцманова 2022/09/05 
// Параметры:
// Контекст, Результат
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры
 // } #wortmann
 
// #wortmann {
// Типовой функционал для добавления команд
// #4.1.15
// Галфинд(Просто) Боцманова 2022/09/05 
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
// } #wortmann
#КонецОбласти
